app/views/blogs/_add_comments.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`blog_id` = 2 ORDER BY `comments`.`id` DESC
---
<% @blog.comments&.order(id:"desc").each do |comment| %>