app/views/shared/blog/_right.html.erb

        <ul class="am-list">
          <% Blog.view_count_top.each do |blog| %>
---
SELECT COUNT(*) FROM `blogs` WHERE (title like '%' )