app/controllers/admin/blogs_controller.rb

SELECT  `blogs`.* FROM `blogs` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `blogs`
---
  def index
    if params[:title]
      @blogs = Blog.where("title like ? ","%#{params[:title]}%").page(params[:page]).per(10)
    elsif params[:category_id]
      @blogs = Blog.where(category_id:params[:category_id]).page(params[:page]).per(10)
    else
      @blogs = Blog.all.page(params[:page]).per(10)