app/controllers/admin/comments_controller.rb

  def index
    @y = SearchParams.new(params[:search_params] || {})
    @comments = Comment.default_where(@y.attributes(self)).page(params[:page]).per(10)
---
SELECT  `comments`.* FROM `comments` LIMIT 10 OFFSET 0

    def set_comment
      @comment = Comment.find(params[:id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1