app/controllers/admin/employees_controller.rb

SELECT  `employees`.* FROM `employees` LIMIT 10 OFFSET 0
---
  def index
    @q = SearchParams.new(params[:search_params] || {})
    @employees = Employee.default_where(@q.attributes(self)).page(params[:page]).per(10)

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 ORDER BY `employees`.`id` ASC LIMIT 1
---
  def add_roles
    @employee = Employee.find(params[:id])

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 ORDER BY `employees`.`id` ASC LIMIT 1
---
  def save_roles
    @employee = Employee.find(params[:id])

SELECT  `employees`.* FROM `employees` WHERE `employees`.`id` = 1 ORDER BY `employees`.`id` ASC LIMIT 1
---
  def set_employee
    @employee = Employee.find(params[:id])