app/views/admin/employees/_add_roles.html.erb


    <% Role.all.each do |role|%>
	    <label class="checkbox">
	      <%= check_box_tag "employee[role_ids][]",role.id,@employee.role_ids.include?(role.id )%> <%= role.name %>
---
SELECT `roles`.* FROM `roles`
SELECT `roles`.id FROM `roles` INNER JOIN `employees_roles` ON `roles`.`id` = `employees_roles`.`role_id` WHERE `employees_roles`.`employee_id` = 1