app/controllers/blogs_controller.rb

  def index
    if params[:title]
      @blogs = Blog.where("title like ? ","%#{params[:title]}%").page(params[:page]).per(10)
    elsif params[:category_id]
      @blogs = Blog.where(category_id:params[:category_id]).page(params[:page]).per(10)
    else
      @blogs = Blog.all.page(params[:page]).per(10)
---
SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`title` = 'sw2'
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`category_id` = 1 LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `blogs`
SELECT `blogs`.* FROM `blogs`

  def top_search
    @blogs = Blog.where("title like '#{params[:title]}%' ").page(params[:page]).per(9)
---
SELECT  `blogs`.* FROM `blogs` WHERE (title like 'aw%' ) LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `blogs` WHERE (title like '%' )

  def add_comments
	Comment.create(blog_id:@blog.id,content:params[:comment_text])
---
INSERT INTO `comments` (`content`, `blog_id`, `created_at`, `updated_at`) VALUES ('666', 2, '2017-08-08 07:05:21', '2017-08-08 07:05:21')

  def show
    @blog.update(view_count: @blog.view_count.to_i + 1)
---
UPDATE `blogs` SET `view_count` = 1, `updated_at` = '2017-07-30 10:10:18' WHERE `blogs`.`id` = 2

  def create
    @blog = Blog.new(blog_params)
    respond_to do |format|
      if @blog.save
---
INSERT INTO `blogs` (`title`, `content`, `created_at`, `updated_at`) VALUES ('test2', '6666', '2017-07-23 08:04:53', '2017-07-23 08:04:53')

  def update
    respond_to do |format|
      if @blog.update(blog_params)
        unless params[:draft_img].blank?
          attachment = Attachment.create(attachment_entity_type: "Blog",attachment_entity_id: @blog.id , path: params[:draft_img], created_by: 1 )
---
UPDATE `blogs` SET `category_id` = 1, `updated_at` = '2017-07-29 06:58:51' WHERE `blogs`.`id` = 25
INSERT INTO `attachments` (`attachment_entity_type`, `attachment_entity_id`, `path`, `name`, `content_type`, `file_size`, `created_at`, `updated_at`, `created_by`) VALUES ('Blog', 25, '03.jpg', '03.jpg', 'image/jpeg', 66290, '2017-07-29 06:58:25', '2017-07-29 06:58:25', '1')

  def destroy
    @blog.destroy
---
DELETE FROM `blogs` WHERE `blogs`.`id` = 1

    def set_blog
      @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = NULL LIMIT 1