app/views/admin/blogs/_form.html.erb

SELECT `categories`.* FROM `categories`
---
	  <div class="controls">
	    <%= f.select :category_id, options_for_select(Category.all.collect { |p| [ p.name, p.id ] }, ''), {include_blank: true}, {class: 'form-control input-sm', style: 'width: 280px;' } %>